app/controllers/tasks_controller.rb

  def index
    if user_signed_in?
      @tasks = Task.where(:user_id => current_user.id).order("created_at DESC")
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 2]]

  def create
    @task = current_user.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Testing"], ["description", "Testing again"], ["created_at", "2018-05-17 03:05:52.550463"], ["updated_at", "2018-05-17 03:05:52.550463"], ["user_id", 1]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?

  def complete
    @task = Task.find(params[:id])
    @task.update_attribute(:completed_at, Time.now)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2018-05-17 03:04:57.626228"], ["updated_at", "2018-05-17 03:04:57.627330"], ["id", 1]]

  def find_task
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]